{
  "name": "Amit Kumar Mahapatra",
  "label": "Generative AI Engineer",
  "image_path": "img/passport_size_image_white_bg_formal.jpg",
  "contact": {
    "email": "mahapatraarhas200@gmail.com",
    "phone": "+91-8114-362199",
    "location": "Bhubaneswar, Odisha, India"
  },
  "summary": "A short summary of who you are, your background, experience, and interests to give visitors a quick introduction to you.",
  "base_url": "127.0.0.1:5500",
  "social_links": [
    {
      "label": "Portfolio",
      "url": "https://sample.com",
      "svg_path": "img/globe.svg"
    },
    {
      "label": "LinkedIn",
      "url": "https://www.linkedin.com/in/amitmahapatrav5/",
      "svg_path": "img/linkedin.svg"
    },
    {
      "label": "GitHub",
      "url": "https://github.com/amitmahapatrav5",
      "svg_path": "img/github.svg"
    }
  ],
  "work_experience": [
    {
      "company": "Tata Consultancy Services",
      "position": "IT Analyst",
      "url": "https://www.tcs.com/",
      "start_date": "08/10/2020",
      "end_date": "Present",
      "summary": "Short summary about present job and what the position entails",
      "highlights": [
        "First Duty of Current Job",
        "Second Duty of Current Job",
        "Third Duty of Current Job"
      ]
    }
  ],
  "projects": [
    {
      "title": "EHS&S Incident Reporting Gen AI Chatbot - MVP 1",
      "summary": "Developed a GenAI-powered chatbot system to replace traditional form-based data entry for Environmental Health, Safety and Sustainability(EHS&S) incident reporting, reducing data collection rework and licensing costs while improving user engagement through conversational AI interface.",
      "highlights": [
        "Engineered RESTful API to process free-text user inputs and deliver summarized, structured responses, enhancing data quality and consistency for downstream processing, achieving <2-second response time per API interaction and ensuring real-time user experience.",
        "Leveraged Langchain framework to orchestrate OpenAI-4o LLM integration, enabling intelligent context summarization and natural language understanding from unstructured user inputs, supporting >5,000 Good Saves per month adoption rate through improved user accessibility.",
        "Implemented Guardrail AI validation pipeline to ensure AI safety through multi-layer content filtering, mitigating risks of hallucinations, bias, and toxic content generation in LLM responses, maintaining <5% data error rate through chatbot-driven validation and quality checks.",
        "Developed robust audit system using FastAPI and SQLAlchemy ORM, implementing Pydantic models for type-safe serialization/deserialization of conversation histories, ensuring compliance and traceability requirements while contributing to ~70% reduction in license-related costs by eliminating dependency on traditional form-based systems.",
        "Integrated submission API with Internal System to automate Good Save record Draft creation, streamlining SME review and reducing manual data entry overhead, achieving 90% successful API submission rate for seamless data flow to backend systems."
      ]
    },
    {
      "title": "EHS&S Incident Reporting Gen AI Chatbot - MVP 2 - POC",
      "summary": "Prototyped the GenAI chatbot enhancement featuring vector similarity search against validated Golden Records database, implementing dynamic clarifying question generation to improve data collection accuracy, and expanding incident classification capabilities to support multiple EHS&S incident types including Good Save and Near Miss reporting scenarios.",
      "highlights": [
        "Implemented vector embeddings using ChromaDB vector database to index and retrieve Golden Records, enabling semantic similarity search with sub-second query performance for contextual reference matching during incident reporting.",
        "Developed intelligent clarifying question generation system leveraging Langchain's retrieval-augmented generation (RAG) architecture, dynamically formulating context-specific questions based on similar Golden Records to capture comprehensive incident details and reduce ambiguity in user submissions.",
        "Built automated incident classification engine utilizing OpenAI-4o model to accurately categorize incidents across multiple taxonomy levels, distinguishing between Good Save, Near Miss, and other EHS&S event types with high precision.",
        "Optimized prompt engineering strategies implementing few-shot learning techniques and structured output templates, enabling context-aware response generation with improved factual accuracy and consistent formatting for downstream system integration."
      ]
    },
    {
      "title": "Pluggable Multimodal RAG for Secure Knowledge Retrieval",
      "summary": "Developed a pluggable Retrieval-Augmented Generation (RAG) framework that avoids costly fine-tuning by leveraging Hugging Face pre-trained models with ChromaDB vector search, laying the foundation for multi-hop reasoning and grounded answers in later phases.",
      "highlights": [
        "Implemented document ingestion for structured (.csv, .xls, .json) and unstructured (.txt, .md, .pdf, .docx, .pptx) formats using **LangChain loaders**, ensuring modular support for future plug-ins.",
        "Built preprocessing pipeline with **LangChain Text Splitters** (Recursive, Character, Markdown, NLTK, spaCy) to dynamically generate high-quality chunks tailored to file types.",
        "Integrated **Hugging Face Embeddings** for vectorization and persisted results in **ChromaDB**, enabling semantic similarity search as the backbone of the RAG loop.",
        "Designed modular ingestion architecture with caching, loaders, splitters, enrichers, and vector store executors, improving maintainability and scalability.",
        "Exposed ingestion and retrieval workflows via **FastAPI** endpoints, routed through an API Gateway with service-specific APIs (SQL metadata API, content API, and GenAI query API).",
        "Implemented query handling pipeline: **Retriever → PromptTemplate → Hugging Face LLM (ChatHuggingFace) → StrOutputParser**, enforcing concise, grounded answers strictly from retrieved context.",
        "Improved retrieval reliability and reduced implementation risk by adopting pre-trained **Hugging Face models** with vector search instead of costly fine-tuning, enabling incremental upgrades in later phases.",
        "Established secure, team-specific retrieval boundaries by embedding ownership metadata, preventing cross-team data exposure while improving knowledge accessibility."
      ]
    },
    {
      "title": "Backend Application using FastAPI",
      "summary": "Short summary about my second project",
      "highlights": [
        "First Highlight of Project Two",
        "Second Highlight of Project Two",
        "Third Highlight of Project Two"
      ]
    }
  ],
  "education": [
    {
      "institution": "Silicon Institute of Technology",
      "location": "Bhubaneswar, Odisha, India",
      "url": "https://silicon.ac.in/",
      "degrees": [
        "Bachelor of Technology"
      ],
      "honors": [
        "Outstanding Student Award",
        "Dean's List"
      ],
      "gpa_cumulative": "8.85",
      "graduation_date": "31/07/2020"
    }
  ],
  "skills": [
    {
      "name": ["Generative AI", "RAG", "Langchain", "ChromaDB", "FAISS"],
      "proficiency": 100,
      "proficiency_label": "Proficiency Level"
    },
    {
      "name": ["Agentic AI", "Langgraph", "MCP"],
      "proficiency": 100,
      "proficiency_label": "Proficiency Level"
    },
    {
      "name": ["Backend Engineering", "RESTful API", "gRPC", "Web Sockets", "FastAPI", "SQLAlchemy", "PostgreSQL", "Docker"],
      "proficiency": 80,
      "proficiency_label": "Proficiency Level"
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Professional Working Proficiency"
    },
    {
      "language": "Odia",
      "fluency": "Native speaker"
    }
  ]
}